In [4]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
Salaries_df = pd.read_csv(r'C:\Users\e150230\OneDrive - Mohawk Industries\Desktop\Data Analytics\project\Data Analytics\UCDPA_ann-marie_devlin\ds_salaries.csv')

In [6]:
Salaries_df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [7]:
#cleaning data
Salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Unnamed: 0          607 non-null    int64
 1   work_year           607 non-null    int64
 2   experience_level    607 non-null    object
 3   employment_type     607 non-null    object
 4   job_title           607 non-null    object
 5   salary              607 non-null    int64
 6   salary_currency     607 non-null    object
 7   salary_in_usd       607 non-null    int64
 8   employee_residence  607 non-null    object
 9   remote_ratio        607 non-null    int64
 10  company_location    607 non-null    object
 11  company_size        607 non-null    object
dtypes: int64(5), object(7)
memory usage: 57.0+ KB

In [8]:
Salaries_df['salary_currency']

0      EUR
1      USD
2      GBP
3      USD
4      USD
      ...
602    USD
603    USD
604    USD
605    USD
606    USD
Name: salary_currency, Length: 607, dtype: object

In [9]:
Salaries_df.describe()

       Unnamed: 0    work_year        salary  salary_in_usd  remote_ratio
count  607.000000   607.000000  6.070000e+02     607.000000     607.00000
mean   303.000000  2021.405272  3.240001e+05  112297.869852      70.92257
std    175.370085     0.692133  1.544357e+06   70957.259411      40.70913
min      0.000000  2020.000000  4.000000e+03    2859.000000       0.00000
25%    151.500000  2021.000000  7.000000e+04   62726.000000      50.00000
50%    303.000000  2022.000000  1.150000e+05  101570.000000     100.00000
75%    454.500000  2022.000000  1.650000e+05  150000.000000     100.00000
max    606.000000  2022.000000  3.040000e+07  600000.000000     100.00000

In [10]:
Salaries_df.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [11]:
#Replacing some of the values to understand the graphs clearly
Salaries_df.remote_ratio.replace([100,50,0], ['Remote', 'Hybrid' ,'On-site'],inplace = True)
Salaries_df.experience_level.replace(['EN','MI','SE', 'EX'], ['Entry', 'Mid', 'Senior', 'Executive'], inplace = True)
Salaries_df.company_size.replace(['S','M','L'], ['Small', 'Medium', 'Large'], inplace = True)

In [12]:
# to see changes in values
Salaries_df.head(100)

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,Mid,FT,Data Scientist,70000,EUR,79833,DE,On-site,DE,Large
1,1,2020,Senior,FT,Machine Learning Scientist,260000,USD,260000,JP,On-site,JP,Small
2,2,2020,Senior,FT,Big Data Engineer,85000,GBP,109024,GB,Hybrid,GB,Medium
3,3,2020,Mid,FT,Product Data Analyst,20000,USD,20000,HN,On-site,HN,Small
4,4,2020,Senior,FT,Machine Learning Engineer,150000,USD,150000,US,Hybrid,US,Large
...,...,...,...,...,...,...,...,...,...,...,...,...
95,95,2021,Mid,FT,Cloud Data Engineer,120000,SGD,89294,SG,Hybrid,SG,Large
96,96,2021,Entry,PT,AI Scientist,12000,USD,12000,BR,Remote,US,Small
97,97,2021,Mid,FT,Financial Data Analyst,450000,USD,450000,US,Remote,US,Large
98,98,2021,Entry,FT,Computer Vision Software Engineer,70000,USD,70000,US,Remote,US,Medium
99,99,2021,Mid,FT,Computer Vision Software Engineer,81000,EUR,95746,DE,Remote,US,Small

In [13]:
# Web scrapping using Pandas , Pandas already imported
import requests

In [17]:
# World Data Web Scrap
url = 'https://www.worlddata.info/average-income.php'
tables = pd.read_html(url)

In [21]:
tables[0]

    Rank      Country Avg. income perÂ year Avg. income perÂ month
0      1       Monaco            186,080 $              15,507 $
1      2    Bermuda *            122,470 $              10,206 $
2      3  Switzerland             90,600 $               7,550 $
3      4   Luxembourg             88,190 $               7,349 $
4      5       Norway             83,880 $               6,990 $
..   ...          ...                  ...                   ...
64    65        Nepal              1,220 $                 102 $
65    66  Timor-Leste              1,140 $                  95 $
66    67     Ethiopia                940 $                  78 $
67    68        Sudan                650 $                  54 $
68    69  Afghanistan                390 $                  33 $

[69 rows x 4 columns]

In [23]:
df = tables[0]
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69 entries, 0 to 68
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Rank                   69 non-null     int64
 1   Country                69 non-null     object
 2   Avg. income perÂ year   69 non-null     object
 3   Avg. income perÂ month  69 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.3+ KB

            Rank
count  69.000000
mean   35.000000
std    20.062403
min     1.000000
25%    18.000000
50%    35.000000
75%    52.000000
max    69.000000

In [24]:
df.to_csv('World Avg Salaries.csv')

In [26]:
pd.read_csv('World Avg Salaries.csv')

    Unnamed: 0  Rank      Country Avg. income perÂ year Avg. income perÂ month
0            0     1       Monaco            186,080 $              15,507 $
1            1     2    Bermuda *            122,470 $              10,206 $
2            2     3  Switzerland             90,600 $               7,550 $
3            3     4   Luxembourg             88,190 $               7,349 $
4            4     5       Norway             83,880 $               6,990 $
..         ...   ...          ...                  ...                   ...
64          64    65        Nepal              1,220 $                 102 $
65          65    66  Timor-Leste              1,140 $                  95 $
66          66    67     Ethiopia                940 $                  78 $
67          67    68        Sudan                650 $                  54 $
68          68    69  Afghanistan                390 $                  33 $

[69 rows x 5 columns]

Empty DataFrame
Columns: []
Index: []